Repository: jedoCodes/contao-marquee-bundle
Catalog: contao/languages/*/*_content.xlf
Languages: de

# tl_content.marqueeSlider_legend
source: Marquee Slider - Settings
de: Marquee Slider - Einstellungen

# tl_content.marqueeListitems_legend
source: Marquee Text-Slider - List Items
de: Marquee Text-Slider - Listeneinträge

# tl_content.marqueeType.0
source: Marquee Slider Type
de: Marguee Slider Type

# tl_content.marqueeType.1
source: Select the type of slider you want to use.
de: Wählen Sie aus, welche Art von Slider sie einsetzen wollen.

# tl_content.marqueeSpeed.0
source: Speed
de: Geschwindigkeit

# tl_content.marqueeSpeed.1
source: The speed of the movement can be standardized or customized, allowing for different animation effects.
de: Die Geschwindigkeit der Bewegung kann standardisiert oder benutzerdefiniert sein, sodass unterschiedliche Animationseffekte möglich sind

# tl_content.marqueeCustomSpeed.0
source: Custom Speed
de: Benutzerdefinierte Geschwindigkeit

# tl_content.marqueeCustomSpeed.1
source: Enter the desired speed in seconds here.
de: Geben Sie hier die gewünschte Geschwindigkeit in Sekunden ein.

# tl_content.marqueeRotate.1
source: The rotation degree is specified in degrees and indicates how many degrees the slider is rotated from the horizontal. A value of 45 means a rotation of 45 degrees.
de: Die Rotationsgrad wird in Grad angegeben und gibt an, um wie viele Grad der Slider gegenüber der Horizontalen gedreht werden soll. Ein Wert von 45 bedeutet beispielsweise eine Drehung um 45 Grad.

# tl_content.marqueeDirection.0
source: Direction
de: Richtung

# tl_content.marqueeDirection.1
source: Set the direction of the movement.
de: Legen Sie die Richtung der Bewegung fest.

# tl_content.marqueeListItems.0
source: List Items
de: Listeneinträge

# tl_content.marqueeListItems.1
source: If JavaScript is disabled, be sure to save your changes before changing the order.
de: Wenn JavaScript deaktiviert ist, speichern Sie unbedingt Ihre Änderungen, bevor Sie die Reihenfolge ändern.

# tl_content.marqueeType_options.marqueeText.0
source: Text-List Slider
de: Text-Liste Slider

# tl_content.marqueeType_options.marqueeText.1
source: The Text-List Slider is a special type of slider that displays text content in continuous motion. This type of slider can be used to present news, announcements, quotes, or any textual elements on a website in an engaging and dynamic way.
de: Der Text-Liste Slider ist eine spezielle Art von Slider, der Textinhalte in einer fortlaufenden Bewegung darstellt. Diese Art von Slider kann verwendet werden, um Nachrichten, Ankündigungen, Zitate oder beliebige textuelle Elemente auf einer Webseite ansprechend und dynamisch zu präsentieren.

# tl_content.marqueeType_options.marqueeGalerie.0
source: Image Gallery Slider
de: Bilder-Galerie Slider

# tl_content.marqueeType_options.marqueeGalerie.1
source: The Image Gallery Slider is a type of slider that displays a collection of images in continuous motion. This functionality is ideal for presenting image galleries, product images, logos, or other visual content in an engaging and dynamic way.
de: Der Bilder-Galerie Slider ist eine Art von Slider, der eine Sammlung von Bildern in einer fortlaufenden Bewegung darstellt. Diese Funktionalität eignet sich hervorragend, um Bildgalerien, Produktbilder, Logos oder andere visuelle Inhalte auf ansprechende und dynamische Weise zu präsentieren.

# tl_content.marqueeDirection_options.right.0
source: From Left to Right
de: von Links nach Rechts

# tl_content.marqueeDirection_options.right.1
source: The slider moves from left to right (reverse).
de: Der Slider bewegt sich von links nach rechts (reverse)

# tl_content.marqueeDirection_options.left.0
source: From Right to Left
de: von Rechts nach Links

# tl_content.marqueeDirection_options.left.1
source: The slider moves from right to left (forwards).
de: Der Slider bewegt sich von rechts nach links (forwards)

# tl_content.marqueeSpeed_options.slow.0
source: Slow
de: Langsam

# tl_content.marqueeSpeed_options.slow.1
source: The speed of the image movement is set to 60s. This is very slow.
de: Geschwindigkeit der Bildbewegung ist auf den Wert 60s festgelegt. Das ist sehr langsam.

# tl_content.marqueeSpeed_options.fast.0
source: Fast
de: Schnell

# tl_content.marqueeSpeed_options.fast.1
source: The speed of the image movement is set to 20s. This is fast.
de: Geschwindigkeit der Bildbewegung ist auf den Wert 20s festgelegt. Das ist schnell.

# tl_content.marqueeSpeed_options.custom.0
source: Custom
de: Induviduell

# tl_content.marqueeSpeed_options.custom.1
source: The speed of the image movement can be set individually.
de: Geschwindigkeit der Bildbewegung kann individuell festgelegt werden.
